Repository: JusticeRage/Gepetto
Catalog: gepetto-locales/*/LC_MESSAGES/gepetto.po
Languages: es_es

source: Explain function
es_es: Explicar la función

source: Rename variables
es_es: Renombrar las variables

source: Uses gpt-3.5-turbo to enrich the decompiler's output
es_es: Utiliza gpt-3.5-turbo para enriquecer la salida del descompilador

source: See usage instructions on GitHub
es_es: Ver instrucciones de uso en GitHub

source: Use gpt-3.5-turbo to explain the currently selected function
es_es: Usar gpt-3.5-turbo para explicar la función seleccionada actualmente

source: Use gpt-3.5-turbo to rename this function's variables
es_es: Usar gpt-3.5-turbo para renombrar las variables de esta función

source: Comment generated by Gepetto
es_es: Comentario generado por Gepetto

source: gpt-3.5-turbo query finished!
es_es: Consulta de gpt-3.5-turbo finalizada!

source: Can you explain what the following C function does and suggest a better name for it? {decompiler_output}
es_es: ¿Puede explicar qué hace la siguiente función en C y sugerir un mejor nombre para ella? {decompiler_output}

source: Could not obtain valid data from the model, giving up. Dumping the response for manual import:
es_es: No se pudo obtener datos válidos del modelo, abandonando. Volcando la respuesta para la importación manual:

source: Cannot extract valid JSON from the response. Asking the model to fix it...
es_es: No se puede extraer un JSON válido de la respuesta. Pidiendo al modelo que lo arregle...

source: The JSON document returned is invalid. Asking the model to fix it...
es_es: El documento JSON devuelto no es válido. Pidiendo al modelo que lo arregle...

source: Please fix the following JSON document:
es_es: Por favor, arregle el siguiente documento JSON:

source: The JSON document provided in this response is invalid. Can you fix it? {response}
es_es: El documento JSON proporcionado en esta respuesta no es válido. ¿Puede arreglarlo? {response}

source: gpt-3.5-turbo query finished! {replaced} variable(s) renamed.
es_es: Consulta de gpt-3.5-turbo finalizada! Se renombraron {replaced} variable(s).

source: Analyze the following C function: {decompiler_output} Suggest better variable names, reply with a JSON array where keys are the original names and values are the proposed names. Do not explain anything, only print the JSON dictionary.
es_es: Analizar la siguiente función en C: {decompiler_output} Sugerir mejores nombres de variables, responder con una matriz JSON donde las claves son los nombres originales y los valores son los nombres propuestos. No explique nada, solo imprima el diccionario JSON.

source: gpt-3.5-turbo could not complete the request: {error}
es_es: gpt-3.5-turbo no pudo completar la solicitud: {error}

source: Context length exceeded! Reducing the completion tokens to {max_tokens}...
es_es: ¡Límite de longitud del contexto excedido! Reduciendo los tokens de finalización a {max_tokens}...

source: Unfortunately, this function is too big to be analyzed with the model's current API limits.
es_es: Desafortunadamente, esta función es demasiado grande para ser analizada con los límites actuales de la API del modelo.

source: General exception encountered while running the query: {error}
es_es: Se encontró una excepción general mientras se ejecutaba la consulta: {error}

source: Request to gpt-3.5-turbo sent...
es_es: Solicitud enviada a gpt-3.5-turbo...

source: Please edit this script to insert your OpenAI API key!
es_es: ¡Edite este script para insertar su clave de API de OpenAI!
